import React from 'react'
import { Link } from 'react-router-dom'

const Home = () => {
    return (
        <>
            <div className="about">
                <div className="about-text">
                    <div className='adress'>AVANTI вул. Чорновола 12/ САМБІР</div>
                    <h1>Клініка <span>Стоматологічна</span> Самбір</h1>
                    <p> <span>Avanti</span> - це сучасна стоматологічна клініка, розташована у
                        <span> Самборі</span>, яка пропонує широкий спектр стоматологічних послуг.
                        Ми спеціалізуємося на естетичній стоматології, консервативній
                        стоматології та ендодонтичному лікуванні. Наші послуги включають
                        естетична стоматологія ортодонтологія,
                        хірургічна стоматологія та дитяча стоматологія.</p>
                    <p> <span>Інноваційне</span> стоматологічне обладнання, <span>висококваліфікований </span>
                        колектив спеціалістів, <span>дружня</span> обслуговуючий персонал і <span>зручне </span>
                        розташування - це лише декілька з наших переваг. Заплануйте візит
                        до нашої клініки для себе або вашої дитини і дозвольте нам позбавити
                        вас про ваші зуби і забезпечити відмінне самопочуття.</p>
                    <div className="about-btn">
                        <Link to={"/book"}>Записатись на прийом</Link>
                        <Link to={"/contact"}>Контакт</Link>
                    </div>

                </div>

                <img src="./dentalOffice.jpg" alt="dental Office image" />
            </div>

            <div className="benefits">
                <img src="./public/teeth.jpg" alt="Image" />
                <div className="benefits-text">
                    <p>Про нас</p>
                    <h2>Чого AVANTI ?</h2>
                    <p><span>AVANTI</span> – це сучасна <span>стоматологічна</span> клініка,
                        розташована <span> на вулиці Чорновола  12 у Самборі</span>.
                        Саме в нашому центрі ви подбаєте про здорові
                        зуби та сліпучу посмішку під наглядом
                        спеціалізованої команди стоматологів.
                    </p>
                    <ul>
                        <li>Безболісне відвідування та анестезія</li>
                        <li>Досвідчена команда стоматологів</li>
                        <li>Співчуття, доброта та розуміння до пацієнтів</li>
                        <li>Сучасне медичне та стоматологічне обладнання</li>
                        <li>Дуже гарне обслуговування та атмосфера</li>
                        <li>Зручне розташування</li>
                    </ul>
                </div>
            </div>

        </>
    )
}

export default Home