import React from 'react'
import PriceItem from '../ui/PriceItem'

const service = [
    {
        "name": "Пломбування однієї пломби",
        "price": 500
    },
    {
        "name": "Чищення зубів та гігієнічне обстеження",
        "price": 1200
    },
    {
        "name": "Видалення зуба",
        "price": 800
    },
    {
        "name": "Встановлення коронки",
        "price": 1500
    },
    {
        "name": "Лікування карієсу",
        "price": 600
    },
    {
        "name": "Зняття зубного нальоту",
        "price": 300
    },
    {
        "name": "Рентген зубів",
        "price": 250
    },
    {
        "name": "Професійне відбілювання зубів",
        "price": 1700
    },
    {
        "name": "Лікування кореневих каналів",
        "price": 1000
    },
    {
        "name": "Захист від пародонтиту",
        "price": 750
    },
    {
        "name": "Імплантація зуба",
        "price": 2200
    },
    {
        "name": "Пластична хірургія ясен",
        "price": 1300
    },
    {
        "name": "Зняття мудрого зуба",
        "price": 450
    },
    {
        "name": "Видалення зубних каменів",
        "price": 350
    },
    {
        "name": "Керамічна відновлення зуба",
        "price": 1800
    },
    {
        "name": "Протезування одного зуба",
        "price": 1200
    },
    {
        "name": "Медична консультація",
        "price": 50
    },
    {
        "name": "Зняття брекетів",
        "price": 600
    },
    {
        "name": "Масаж ясен",
        "price": 200
    },
    {
        "name": "Санація порожнини рота",
        "price": 400
    },
    {
        "name": "Шинування зубів",
        "price": 300
    },
    {
        "name": "Відновлення відламаних зубів",
        "price": 650
    },
    {
        "name": "Лікування стоматиту",
        "price": 150
    },
    {
        "name": "Видалення пульпіту",
        "price": 500
    },
    {
        "name": "Металеві відновлення зубів",
        "price": 700
    },
    {
        "name": "Знімні протези",
        "price": 900
    },
    {
        "name": "Силіконові пломби",
        "price": 250
    },
    {
        "name": "Корекція прикусу",
        "price": 1100
    },
    {
        "name": "Лікування гінгівіту",
        "price": 300
    }
]



const Price = () => {
    return (
        <ul className='price-container'>
            {service.map(item => <PriceItem key={item.name} price={item.price} name={item.name} />)}
        </ul>
    )
}

export default Price